# St7GetReinforcementLayoutNumByIndex

Returns the reinforcement layout number associated with the specified layout index. The reinforcement layout
indices are stored internally and are based on a contiguous numbering system.

long St7GetReinforcementLayoutNumByIndex(long uID, long Index, long* LayoutID)

Input Parameters

uID

Strand7 model file ID.

Index

Reinforcement layout index.

Output Parameters
LayoutID

Reinforcement layout ID.